app/Models/Staking/StakingCurrency.php

    public function getCache()
    {
        return Cache::remember($this->cacheKey($this) . ':staking_currencies', now()->addHours(4), function () {
            return self::where('status', 1)->latest()->get();
---
select * from `staking_currencies` where `status` = 1 order by `created_at` desc

    public function getCacheCurrency($coin)
    {
        return Cache::remember($this->cacheKey($this) . ':staking_currency_' . $coin, now()->addHours(4), function () use ($coin) {
            return self::where('id', $coin)->first();
---
select * from `staking_currencies` where `id` = 29 limit 1

    public function getCacheCurrencyBySymbol($symbol)
    {
        return Cache::remember($this->cacheKey($this) . ':staking_currency_' . $symbol, now()->addHours(4), function () use ($symbol) {
            return self::where('symbol', $symbol)->first();
---
select * from `staking_currencies` where `symbol` = 'USDT' limit 1