app/Http/Controllers/Extensions/Staking/StakingController.php

select * from `wallets` where `user_id` = 4347
---
    public function fetch_wallets()
    {
        $user = Auth::user();


        $wallets = Wallet::where('user_id', $user->id)

select * from `wallets` where `user_id` = 4347 and `id` = 950 limit 1
---
    public function store_new(Request $request)
    {
        $validate = Validator::make($request->all(), [
            'amount' => 'required|numeric',
            'selected_symbol' => 'required|string', // Wallet currency
            'symbol' => 'required|string', // Staking currency
            'wallet_id' => 'required|numeric',
        ]);

        if ($validate->fails()) {
            return response()->json($validate->errors());
        }

        $user = Auth::user();
        $wallet = Wallet::where('user_id', $user->id)->where('id', $request->wallet_id)->first();

select * from `staking_logs` where `status` in (1, 2) and `coin_id` is null
select * from `staking_logs` where `coin_id` is not null and `status` = 1
---
    public function staking_profit()
    {
        $nullLogs = StakingLog::whereIn('status', [1, 2])->where('coin_id', null)->get();
        $nullLogs->whereIn('status', [1, 2])->each(function ($log) {
            $wallet = getWallet($log->user_id, 'funding', 'USDT', 'funding');
            $wallet->balance += $log->cost;
            $wallet->save();
            $log->delete();
        });
        $nullLogs->whereIn('status', [0, 3])->each(function ($log) {
            $log->delete();
        });
        $stakeLogs = StakingLog::where('coin_id', '!=', null)->where('status', 1)->get();