app/Http/Controllers/Extensions/Futures/WalletController.php

    public function wallets($user_id)
    {
        $futureCurrencies = FutureCurrencies::where('status', 1)->where('provider', $this->provider)->get();
        $futureWallets = FutureWallets::where('user_id', $user_id)->get();
---
select * from `future_currencies` where `status` = 1 and `provider` = 'kucoinfutures'
select * from `future_wallets` where `user_id` = 4347