app/Helpers/helpers.php

update `crons` set `last_run` = '2024-12-02 16:33:08', `crons`.`updated_at` = '2024-12-02 16:33:08' where `code` = 'bot_missed'
---
function cronLastRun($code)
{
    Cron::where('code', $code)->update([
        'last_run' => Carbon::now(),
    ]);

select * from `thirdparty_providers` where `status` = 1 and `type` is null limit 1
---
function getProvider()
{
    return ThirdpartyProvider::where('status', 1)->where('type', null)->first();

select * from `thirdparty_providers` where `status` = 1 and `type` = 'futures' limit 1
---
function getProviderFutures()
{
    return ThirdpartyProvider::where('status', 1)->where('type', 'futures')->first();

select * from `eco_settings` limit 1
---
function getNativeNetwork()
{
    return EcoSettings::first()->network;