app/Http/Controllers/Extensions/Eco/WithdrawController.php

select * from `eco_withdraws` where `status` = 'transaction_performed' and `withdraw_id` is not null
---
    public function verifyTransfers()
    {
        $withdrawals = EcoWithdraw::where('status', 'transaction_performed')->where('withdraw_id', '!=', null)->get();

select * from `eco_utxo_wallets`
---
    public function refreshUTXOWallet()
    {
        $wallets = EcoUTXOWallet::get();