app/Models/Forex/ForexLogs.php

select * from `forex_logs`
---
    public function getCache()
    {
        return Cache::remember($this->cacheKey($this) . ':forex_logs', now()->addHours(4), function () {
            return self::with(["investment"])->get();