app/Http/Controllers/CronController.php

select * from `general_settings` limit 1
---
    public function __construct()
    {
        $thirdparty = getProvider();
        if ($thirdparty) {
            $exchange_class = "\\ccxt\\$thirdparty->title";
            $this->api = new $exchange_class(array(
                'apiKey' => $thirdparty->api,
                'secret' => $thirdparty->secret,
                'password' => $thirdparty->password,
            ));
            $this->provider = $thirdparty->title;
        } else {
            $this->provider = null;
        }
        $this->gnl = GeneralSetting::first();

select * from `trade_logs` where `status` = 0 and `in_time` < '2024-12-01 18:07:06'
---
    public function trade_results()
    {
        $tradeLogs = TradeLog::where('status', 0)->where('in_time', '<', Carbon::now())->get();

select * from `practice_logs` where `status` = 0 and `in_time` < '2024-12-01 18:25:08'
---
    public function practice_results()
    {
        $practiceLogs = PracticeLog::where('status', 0)->where('in_time', '<', Carbon::now())->get();

select * from `scheduled_orders` where `status` = 0
---
    public function schedule_orders()
    {
        $logs = ScheduledOrders::where('status', 0)->get();

select `symbol` from `pairs` where `provider` = 'kucoin'
select * from `pairs` where `provider` = 'kucoin' and `symbol` = 'USDT' limit 1
---
    public function pairs_to_table()
    {
        if ($this->provider !== null) {
            $pairs = Pairs::where('provider', $this->provider)->pluck('symbol');

            foreach ($pairs as $pair) {
                $currency = Pairs::where('provider', $this->provider)->where('symbol', $pair)->first();

select * from `pairs` where `provider` = 'kucoin'
select * from `kucoin_currencies`
---
    public function currencies()
    {
        if ($this->provider === null) {
            return;
        }

        $pairs =  Pairs::where('provider', $this->provider)->get();
        if ($this->provider == 'coinbasepro') {
            $currencies = CoinbaseCurrencies::get();
        } else if ($this->provider == 'binance' || $this->provider == 'binanceus') {
            $currencies = BinanceCurrencies::get();
        } else if ($this->provider == 'kucoin') {
            $currencies = KucoinCurrencies::get();

select * from `thirdparty_orders` where `provider` = 'kucoin' and `status` != 'closed'
---
    public function fetch_order()
    {
        if ($this->provider === null) {
            return;
        }

        $transactions = ThirdpartyOrders::where('provider', $this->provider)
            ->where('status', '!=', 'closed')
            ->get();