app/Http/Controllers/UserController.php

update `users` set `demo_trade` = 'active', `users`.`updated_at` = '2024-12-02 14:42:26' where `id` = 4347
---
    public function index(Request $request)
    {
        // if($request->any == 'trade/live'){
        //     // if(Auth::user()->userplan == null || (Auth::user()->userplan != null)){
        //     //     return redirect(route("app.home.component", 'plan'));
        //     // }
        //     User::where('id', Auth::user()->id)->update(['demo_trade'=>'not_active']);
        // }else if($request->any == 'trade/demo'){
        //     User::where('id', Auth::user()->id)->update(['demo_trade'=>'active']);
        // }
        if($request->any == 'trade/live'){
            // if(Auth::user()->userplan == null || (Auth::user()->userplan != null)){
            //     return redirect(route("app.home.component", 'plan'));
            // }
            User::where('id', Auth::user()->id)->update(['demo_trade'=>'not_active']);
        }else if($request->any == 'trade/demo'){
            User::where('id', Auth::user()->id)->update(['demo_trade'=>'active']);