app/Http/Controllers/WalletController.php

    public function fetch_wallets()
    {
        $user = Auth::user();

        // Get the currencies based on the provider
        if ($this->provider == 'coinbasepro') {
            $currencies = (new CoinbaseCurrencies)->getEnabled();
        } elseif ($this->provider == 'kucoin' || $this->provider == 'funding') {
            $currencies = (new KucoinCurrencies)->getEnabled();
        } elseif ($this->provider == 'binance' || $this->provider == 'binanceus') {
            $currencies = (new BinanceCurrencies)->getEnabled();
        } elseif ($this->provider == 'bitget') {
            $currencies = (new BitgetCurrencies())->getEnabled();
        } else {
            return response()->json([
                'error' => 'Invalid provider',
                'currencies' => [],
                'api' => 0,
            ]);
        }
        // Get the wallets based on the provider
        if (Wallet::where('provider', '!=', 'local')->where('user_id', $user->id)->exists()) {
---
select exists(select * from `wallets` where `provider` != 'local' and `user_id` = 4347) as `exists`

        $currenciesWithWallets = $currencies->map(function ($currency) use ($wallets, $user, $echo_wallets) {
            foreach (['trading', 'funding', 'eco'] as $walletType) {
                if ($walletType == 'eco') {
                    $currencyWallet = EcoWallet::where('user_id', $user->id)->where('symbol', $currency->symbol)->first();
---
select * from `eco_wallets` where `user_id` = 4347 and `symbol` = 'FET' limit 1