app/Models/PlanLog.php

    public function getPlanNameAttribute()
    {
        return $this->pricingPlan()->first();
---
select * from `pricing_plans` where `pricing_plans`.`id` = 3 limit 1