app/Models/Role.php

    public function getRoles()
    {
        return Cache::remember($this->cacheKey($this) . ':all_roles', now()->addHours(4), function () {
            return self::query()->with('permissions')->get();
---
select * from `roles`
select `permissions`.*, `permission_role`.`role_id` as `pivot_role_id`, `permission_role`.`permission_id` as `pivot_permission_id` from `permissions` inner join `permission_role` on `permissions`.`id` = `permission_role`.`permission_id` where `permission_role`.`role_id` in (1, 2, 10)