app/Models/Wallet.php

select * from `wallets` where `provider` != 'local' and `user_id` = 4347
---
    public function getCached($id)
    {
        return Cache::remember($this->cacheKey($this) . ':wallets', now()->addHours(4), function () use ($id) {
            return self::where('provider', '!=', 'local')->where('user_id', $id)->get();