app/Http/Controllers/Admin/AdminController.php

    public function trade(){

        // if(Auth::user()->demo_trade !== 'active'){
        //     return redirect(route("home"));
        // }

        $data['pairs'] = CoinPair::whereStatus(1)->orderBy('name', 'asc')->get();
---
select * from `coin_pairs` where `status` = 1 order by `name` asc



        $data['page_title'] = $trade_session == "demo" ? "Demo Trader" : "Live Trader";
        $data['wallets'] = Wallet::where('user_id', Auth::user()->id)->get();
        $data['deposit'] = Deposit::where('user_id', Auth::user()->id)->whereStatus(1)->sum('final_amo');

        $data['initialcat'] = TradeCategory::latest()->whereStatus(1)->first();

        $data['tradeCategory'] = TradeCategory::whereStatus(1)->get();

        $data['pairs'] = CoinPair::whereStatus(1)->orderBy('name', 'asc')->get();

        $livetrades = TradeHistory::whereUserId(Auth::user()->id)->where('trade_type', $trade_session)->latest()->get();

        $data['closed_positions'] = TradeHistory::whereUserId( Auth::user()->id )->whereTradeType($trade_session)->wherePositionStatus('close')->orderBy('updated_at', 'DESC')->get();

        $wallet =  Wallet::where('user_id', Auth::user()->id)->whereIsDefault(1)->first();
        // dd(Auth::user()->id);
        $data['history'] = TradeHistory::whereUserId(Auth::user()->id)->where('trade_type', $trade_session)->whereWalletId( $wallet->id )->wherePositionStatus('open')->latest()->paginate(10);
---
select * from `wallets` where `user_id` = 4347
select sum(`final_amo`) as aggregate from `deposits` where `user_id` = 4347 and `status` = 1
select * from `trade_categories` where `status` = 1 order by `created_at` desc limit 1
select * from `trade_categories` where `status` = 1
select * from `coin_pairs` where `status` = 1 order by `name` asc
select * from `trade_histories` where `user_id` = 4347 and `trade_type` = 'demo' order by `created_at` desc
select * from `trade_histories` where `user_id` = 4347 and `trade_type` = 'demo' and `position_status` = 'close' order by `updated_at` desc
select * from `wallets` where `user_id` = 4347 and `is_default` = 1 limit 1
select * from `trade_histories` where `user_id` = 4344 and `trade_type` = 'demo' and `wallet_id` = 944 and `position_status` = 'open' order by `created_at` desc limit 10 offset 0
select count(*) as aggregate from `trade_histories` where `user_id` = 4347 and `trade_type` = 'demo' and `wallet_id` = 950 and `position_status` = 'open'

        $data['userplan'] = Auth::user()->userplan()->with('currentplan')->first();
        $data['isFull'] = false;

        $data['recordLimits'] = TradeLimits::whereUserId(Auth::user()->id)->first();
        $data['license'] = UserLicense::whereUserId(Auth::user()->id)->first();


        $nowTime = Carbon::now(new DateTimeZone('Europe/London'))->toDateTimeString();
        $data['positions_count'] = TradeHistory::whereUserId( Auth::user()->id )->whereWalletId($wallet->id)->wherePositionStatus('open')->whereTradeType($trade_session)->where('end_time', '>', $nowTime)->count();
        $data['positions_count_demo'] = TradeHistory::whereUserId( Auth::user()->id )->whereWalletId($wallet->id)->wherePositionStatus('open')->whereTradeType('demo')->where('end_time', '>', $nowTime)->count();
---
select * from `trade_limits` where `user_id` = 4347 limit 1
select * from `user_licenses` where `user_id` = 4347 limit 1
select count(*) as aggregate from `trade_histories` where `user_id` = 4347 and `wallet_id` = 950 and `position_status` = 'open' and `trade_type` = 'demo' and `end_time` > '2024-12-02 17:22:26'

            $current_balance_raw_demo = (($wallet->balance_demo * $currency_equi)/ $coin_amount);
            $data['current_balance_demo'] = number_format($current_balance_raw_demo, $data['mycurrency']->decimal_digits);
            $data['current_balance_raw_demo'] = $current_balance_raw_demo;
            $profit_loss_user_demo = TradeHistory::whereUserId( Auth::user()->id )->whereWalletId($wallet->id)->wherePositionStatus('open')->whereTradeType('demo')->where('end_time', '>', $nowTime)->sum('profit_loss_user');
---
select sum(`profit_loss_user`) as aggregate from `trade_histories` where `user_id` = 4347 and `wallet_id` = 950 and `position_status` = 'open' and `trade_type` = 'demo' and `end_time` > '2024-12-02 17:22:26'

            // dd($current_balance_raw_demo);
            $equity_raw_demo = floatval($current_balance_raw_demo + floatval($data['profit_loss_user_demo']));
            $data['equity_demo'] = number_format($equity_raw_demo, $data['mycurrency']->decimal_digits);
            $margin_used_raw_demo = TradeHistory::whereUserId( Auth::user()->id )->whereWalletId($wallet->id)->wherePositionStatus('open')->whereTradeType('demo')->where('end_time', '>', $nowTime)->sum('amount_margin_user_currency');
---
select sum(`amount_margin_user_currency`) as aggregate from `trade_histories` where `user_id` = 4347 and `wallet_id` = 950 and `position_status` = 'open' and `trade_type` = 'demo' and `end_time` > '2024-12-02 17:22:26'