app/Http/Controllers/Admin/AdminTradeController.php

select * from `wallets` where `user_id` = 4347 and `is_default` = 1 limit 1
---
    public function saveProfitLossApi(Request $request)
    {

        $rates = (object)$request->rates;

        $profile = Auth::user();

        $trade_session = Auth::user()->demo_trade;

        $default_trade_type = $trade_session == 'active' ? "demo" : "live";

        $nowTime = Carbon::now(new DateTimeZone('Europe/London'))->toDateTimeString();

        $wallet = Wallet::whereUserId(Auth::user()->id)->whereIsDefault(1)->first();

select * from `trade_histories` where `id` = '4480' and `user_id` = 4347 and `position_status` = 'open' limit 1
---

        foreach ($request->payload as $payload) {

            $history = TradeHistory::whereId($payload['id'])->whereUserId(Auth::user()->id)->wherePositionStatus('open')->first();

select count(*) as aggregate from `trade_histories` where `user_id` = 4347 and `position_status` = 'open' and `wallet_id` = 950 and `trade_type` = 'live' and `end_time` > '2024-12-02 14:51:26'
---
            }
        }

        $positions = TradeHistory::whereUserId(Auth::user()->id)->wherePositionStatus('open')->whereWalletId($wallet->id)->whereTradeType($default_trade_type)->where('end_time', '>', $nowTime)->count();

select * from `trade_histories` where `user_id` = 4347 and `position_status` = 'open' and `wallet_id` = 950 and `trade_type` = 'live' and `end_time` > '2024-12-02 14:51:26' order by `created_at` desc limit 10 offset 0
---

        $currentPage = $request->input('page', 1);
        $skip = ($currentPage - 1) * 10;
        $history = TradeHistory::whereUserId(Auth::user()->id)->wherePositionStatus('open')->whereWalletId($wallet->id)->whereTradeType($default_trade_type)->where('end_time', '>', $nowTime)->latest()->skip($skip)->take(10)->get();

select sum(`amount_margin_user_currency`) as aggregate from `trade_histories` where `user_id` = 4347 and `wallet_id` = 950 and `position_status` = 'open' and `trade_type` = 'live' and `end_time` > '2024-12-02 14:51:26'
---
        }


        $margin_used = TradeHistory::whereUserId(Auth::user()->id)->whereWalletId($wallet->id)->wherePositionStatus('open')->whereTradeType($default_trade_type)->where('end_time', '>', $nowTime)->sum('amount_margin_user_currency');