app/Http/Controllers/Admin/UsersController.php

    public function manage($id)
    {
        $user = User::findorFail($id);
        $data['page_title'] = "User Manage";
        $data['user'] = $user;
        $data['last_login'] = UserLogin::whereUser_id($user->id)->orderBy('id', 'desc')->first();
        $data['currencies'] = Currencies::where('status', 1)->get();
---
select * from `users` where `users`.`id` = '4347' limit 1
select * from `user_logins` where `user_id` = 4347 order by `id` desc limit 1
select * from `currencies` where `status` = 1